[["First off...","To do List","The end goal"],{"id":1,"icon":290,"cat":0,"name":"Asking Around","desc":"You successfully murdered the king, but you weren't able to get away, and now you're one of three suspects. Right now, your main goal is figuring out a way that you won't get caught. Maybe asking around can net you some leads?","steps":[],"rewards":[]},{"id":2,"icon":87,"name":"Find the herbs","steps":[["Find out more about where the herb is located",true,8,1,false],["Retrieve the herb",true,1,1,false]],"rewards":[],"cat":1,"desc":"Somewhere in this yard there are some mdeicinal herbs which could prove very useful to your whole \"not-getting-caught\" plan, and you need to find them."},{"id":3,"icon":87,"name":"Find a Mortar & Pestle","steps":[["Ask around for more information",true,9,1,false],["Locate the Mortar & Pestle",true,6,1,false]],"rewards":[],"cat":1,"desc":"You need something to grind up these herbs if you want them to be of any use."},{"id":4,"icon":87,"name":"Grind up the Herbs","steps":[["Successfully mixed the herbs.",true,10,1,false]],"rewards":[["item",5,1,false]],"cat":1,"desc":"Use the Mortar And Pestle to grind up the herbs! (This can be accomplished by selecting the Mortar & Pestle in the inventory menu)"},{"id":5,"icon":231,"name":"The next step","steps":[],"rewards":[],"cat":0,"desc":"Now that you've produced your \"special\" medicine, you've just remembered the location of a key piece of evidence: the mask you hid your identity with resting in the lake..."},{"id":6,"icon":87,"name":"Use the net to fish out the mask","steps":[["Fish the mask from the lake.",true,5,1,false]],"rewards":[],"cat":1,"desc":"Now that I have a fishing net, I can go onto the pier and grab that mask."},{"id":7,"icon":8,"name":"Spike the tea with the medicine","steps":[["Find the teapot and spike it with the  medicine",true,27,1,false]],"rewards":[["item",8,1,false]],"cat":1,"desc":"Now that I have the sleeping medicine, I need to find a way to give it to the guards. Say, it's near break... If I can put it in the tea, they would be none the wiser! Whoever is preparing it should be in the mansion proper."},{"id":8,"icon":8,"name":"Give Jack the spiked tea","steps":[["give it to him",false,28,1,false]],"rewards":[],"cat":1,"desc":"Now that I've spiked the tea with the medicine, time to return it to Jack."},{"id":9,"icon":230,"name":"Framing A Prince: Step One","steps":[["Put the medicine in the teapot and return it to Jack.",true,28,1,false]],"rewards":[],"cat":2,"desc":"If I'm going to do this successfully, I need to find a way to knock out the guards..."},{"id":10,"icon":230,"name":"Framing A Prince: Step Two","steps":[["Plant the mask in the bedroom.",true,29,1,false]],"rewards":[],"cat":2,"desc":"No matter who I frame, I need to plant this mask in the bedroom."},{"id":11,"icon":230,"name":"Framing A Prince: Step Three","steps":[["put katana near the king",true,30,1,false]],"rewards":[],"cat":2,"desc":"Planted to the second emperor"},{"id":12,"icon":87,"name":"Get Prince Juno's Katana","steps":[],"rewards":[],"cat":1,"desc":"Now that I know the katana is in Juno's room, all I have to do is grab it without being noticed..."},{"id":13,"icon":230,"name":"Get Prince Louis' hair pin","steps":[],"rewards":[],"cat":1,"desc":"Now try to get his hair bin in his bed room."},{"id":14,"icon":308,"name":"Framing a Prince","steps":[["Find a way to take the guards out of the equation.",true,28,1,false],["Plant the mask in one of the Prince's bedrooms.",true,33,1,false],["Find key evidence to frame a Prince.",false,1,1,false],["Place the damning evidence on the Kings body!",true,18,1,false]],"rewards":[],"cat":2,"desc":"You are suspected of a murder you did commit. If you want to see the next day, you'll have to frame one of the other suspects; The Kings sons, Prince Juno and Louis."},{"id":15,"icon":82,"name":"Framing Prince Louis","steps":[["Plant the mask in the second floor bedroom.",true,34,1,false],["Find Louis' hairpin.",true,35,1,false]],"rewards":[],"cat":2,"desc":"If I want to frame the elder son Louis, I have two tasks; First, I have to plant the incriminating mask in his room. Then, I'll have to put some damning evidence on King Tem's body. I know he has quite a bit of jewelry... I wonder if I could find some of it..."},{"id":16,"icon":82,"name":"Framing Prince Juno","steps":[["Plant the mask in the first floor bedroom.",true,36,1,false],["Find Juno's katana.",true,31,1,false]],"rewards":[],"cat":2,"desc":"Now, if I want to frame the younger son Juno, I once again have two tasks; First, I have to plant the mask in his room, which is on the first floor. After that, I'll have to again find some incriminating evidence to place on the body. I know he is a fan on weaponry, I wonder if there's a blade in his room I could swipe..."}]